CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_standalone/string/sl_string.c
/* SIBROS TECHNOLOGIES, INC. CONFIDENTIAL
 * Copyright (c) 2018 - 2019 Sibros Technologies, Inc.
 * All Rights Reserved.
 * NOTICE: All information contained herein is, and remains the property of Sibros Technologies,
 * Inc. and its suppliers, if any. The intellectual and technical concepts contained herein are
 * proprietary to Sibros Technologies, Inc. and its suppliers and may be covered by U.S. and Foreign
 * Patents, patents in process, and are protected by trade secret or copyright law. Dissemination of
 * this information or reproduction of this material is strictly forbidden unless prior written
 * permission is obtained from Sibros Technologies, Inc.
 */

#include <ctype.h>
#include <stdarg.h> //lint !e829 -  <stdarg> is required for our desired functionality
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>

#include "sl_string.h"

/*******************************************************************************
 *
 *               P R I V A T E    D A T A    D E F I N I T I O N S
 *
 ******************************************************************************/

/*******************************************************************************
 *
 *                     P R I V A T E    F U N C T I O N S
 *
 ******************************************************************************/
void sl_byte_convert__to_network_from_uint16(uint8_t bytes[2], uint16_t source_value) {
  bytes[0] = (uint8_t)(source_value >> 8);
  bytes[1] = (uint8_t)(source_value >> 0);
}

uint16_t sl_byte_convert__from_network_to_uint16(const uint8_t bytes[2]) {
  return (((uint16_t)bytes[0] << 8) | (uint16_t)bytes[1]);
}

static sl_string_size_t sl_string__private_return_positive_or_zero(const int value) {
  return (value > 0) ? (sl_string_size_t)value : 0U;
}

static bool sl_string__private_ensure_enough_memory_for_insertion(const sl_string_t string,
                                                                  const char *insertion_string) {
  const sl_string_size_t length_of_original_string = sl_string__get_length(string);
  const sl_string_size_t length_of_insertion_string = (sl_string_size_t)strlen(insertion_string);
  const sl_string_size_t memory_required = length_of_original_string + length_of_insertion_string;

  return memory_required < sl_string__get_capacity(string);
}

/**
 * Some compilers do not offer strtok_r() hence we had to port this over
 */
static char *sl_string__private_strtok_r(sl_string_t string, const char *delimiter_string, char **save_ptr) {
  char *end_of_token = NULL;
  char *token = NULL;

  if (NULL == string) {
    string = *save_ptr;
  }

  if (NULL != string) {
    if (0U != sl_string__get_length(string)) {
      string += strspn(string, delimiter_string);
      *save_ptr = string;

      if (0U != sl_string__get_length(string)) {
        end_of_token = string + strcspn(string, delimiter_string);
        *save_ptr = end_of_token;
        token = string;

        if ('\0' != *end_of_token) {
          *end_of_token = '\0';
          *save_ptr = end_of_token + 1;
          token = string;
        }
      }
    }
  }

  return token;
}

/*******************************************************************************
 *
 *                      P U B L I C    F U N C T I O N S
 *
 ******************************************************************************/

sl_string_t sl_string__initialize(void *memory, sl_string_size_t memory_size_max) {
  sl_string_t string = NULL;

  // We need memory to hold sizeof(sl_string_size_t) plus 1 char for a meaningful string and 1 char for NULL
  if ((NULL != memory) && (memory_size_max >= (sizeof(sl_string_size_t) + 2U))) {
    memset(memory, 0, memory_size_max);

    void *header = memory;
    void *string_start = (memory + sizeof(sl_string_size_t));

    sl_byte_convert__to_network_from_uint16(header, memory_size_max);

    string = (sl_string_t)string_start;
  }

  return string;
}

sl_string_t sl_string__initialize_from(void *memory, sl_string_size_t memory_size_max, const char *copy_from) {
  sl_string_t string = sl_string__initialize(memory, memory_size_max);

  if (NULL != string) {
    (void)sl_string__set(string, copy_from);
  }

  return string;
}

sl_string_size_t sl_string__get_capacity(const sl_string_t string) {
  const sl_string_size_t capacity =
      sl_byte_convert__from_network_to_uint16((const uint8_t *)(string - sizeof(sl_string_size_t)));

  // It is okay to to subtract (sizeof() + 1U) from capacity as we
  // check to ensure the memory meets a minimum value during initialization.
  return (sl_string_size_t)(capacity - sizeof(sl_string_size_t) - 1U);
}

sl_string_size_t sl_string__get_capacity_including_null_char(const sl_string_t string) {
  return sl_string__get_capacity(string) + 1U;
}

sl_string_size_t sl_string__get_length(const sl_string_t string) { return (sl_string_size_t)strlen(string); }

bool sl_string__is_full(const sl_string_t string) {
  return sl_string__get_length(string) == sl_string__get_capacity(string);
}

const char *sl_string__c_str(const sl_string_t string) { return string; }

int sl_string__to_int(const sl_string_t string) { return atoi(string); }

double sl_string__to_float(const sl_string_t string) { return atof(string); }

bool sl_string__is_alpha(const sl_string_t string) {
  bool is_alpha = true;
  const sl_string_size_t string_length = sl_string__get_length(string);

  for (sl_string_size_t character = 0; character < string_length; character++) {
    if (0U == isalpha((int)string[character])) {
      is_alpha = false;
      break;
    }
  }

  return is_alpha;
}

bool sl_string__is_alphanum(const sl_string_t string) {
  bool is_alpha_num = true;
  const sl_string_size_t string_length = sl_string__get_length(string);

  for (sl_string_size_t character = 0; character < string_length; character++) {
    if (0U == isalnum((int)string[character])) {
      is_alpha_num = false;
      break;
    }
  }

  return is_alpha_num;
}

void sl_string__clear(sl_string_t string) { *string = '\0'; }

void sl_string__clear_all_memory(sl_string_t string) { memset(string, 0, sl_string__get_capacity(string)); }

void sl_string__to_lower(sl_string_t string) {
  sl_string_t iteration_string = string;
  while ('\0' != *iteration_string) {
    *iteration_string = (char)tolower((int)(*iteration_string));
    iteration_string++;
  }
}

void sl_string__to_upper(sl_string_t string) {
  sl_string_t iterator = string;
  while ('\0' != *iterator) {
    *iterator = (char)toupper((int)(*iterator));
    iterator++;
  }
}

sl_string_size_t sl_string__printf(sl_string_t string, const char *format, ...) {
  va_list args;
  va_start(args, format);
  const sl_string_size_t chars_printed = sl_string__vprintf(string, format, args);
  va_end(args);

  return chars_printed;
}

