CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_standalone/string/sl_string.c
sl_string_size_t sl_string__vprintf(sl_string_t string, const char *format, va_list args) {
  const sl_string_size_t capacity = sl_string__get_capacity_including_null_char(string);
  const int chars_printed = vsnprintf(string, capacity, format, args);
  return sl_string__private_return_positive_or_zero(chars_printed);
}

sl_string_size_t sl_string__printf_append(sl_string_t string, const char *format, ...) {
  va_list args;
  va_start(args, format);
  const sl_string_size_t chars_printed = sl_string__vprintf_append(string, format, args);
  va_end(args);

  return chars_printed;
}

sl_string_size_t sl_string__vprintf_append(sl_string_t string, const char *format, va_list args) {
  const sl_string_size_t existing_length = sl_string__get_length(string);
  const sl_string_size_t remaining_capacity = sl_string__get_capacity_including_null_char(string) - existing_length;
  const int chars_printed = vsnprintf(string + existing_length, remaining_capacity, format, args);

  return sl_string__private_return_positive_or_zero(chars_printed);
}

size_t sl_string__scanf(const sl_string_t string, const char *format, ...) {
  va_list args;
  va_start(args, format);

  const int number_of_parsed_params = vsscanf(string, format, args);
  va_end(args);

  return (number_of_parsed_params > 0) ? (sl_string_size_t)number_of_parsed_params : 0U;
}

int sl_string__tokenize(sl_string_t string, const char *delimiter_string, int char_ptr_count, ...) {
  int token_count = sl_string_error;

  if (NULL != delimiter_string) {
    va_list args;
    va_start(args, char_ptr_count);

    token_count = 0;
    char *save_pointer = NULL;
    char *token = sl_string__private_strtok_r(string, delimiter_string, &save_pointer);

    while ((NULL != token) && (char_ptr_count > 0)) {
      char **param_argument = va_arg(args, char **);
      if (NULL != param_argument) {
        *param_argument = token;
      }

      token = sl_string__private_strtok_r(NULL, delimiter_string, &save_pointer);

      char_ptr_count--;
      token_count++;
    }
    va_end(args);
  }

  return token_count;
}

bool sl_string__set(sl_string_t string, const char *source) {
  bool result = false;

  if (NULL != source) {
    const sl_string_size_t source_length = (sl_string_size_t)strlen(source);
    const sl_string_size_t destination_length = sl_string__get_capacity(string);
    if (destination_length >= source_length) {
      strncpy(string, source, destination_length);
      result = true;
    }
  }

  return result;
}

bool sl_string__insert_at(sl_string_t string, sl_string_size_t index_position, const char *insert) {
  bool result = false;

  if (NULL != insert) {
    if (index_position <= sl_string__get_length(string)) {
      if (sl_string__private_ensure_enough_memory_for_insertion(string, insert)) {
        const size_t length_of_insertion_string = strlen(insert);

        char *position_of_insertion = string + index_position;
        char *destination_of_substring = position_of_insertion + length_of_insertion_string;
        const sl_string_size_t length_to_be_moved =
            sl_string__get_length(string) - index_position + 1U; // Plus 1 for the null term

        memmove(destination_of_substring, position_of_insertion, length_to_be_moved);
        strncpy(position_of_insertion, insert, length_of_insertion_string);

        result = true;
      }
    }
  }

  return result;
}

bool sl_string__append(sl_string_t string, const char *append) {
  bool result = false;

  if (NULL != append) {
    if (sl_string__private_ensure_enough_memory_for_insertion(string, append)) {
      sl_string_size_t current_length = sl_string__get_length(string);
      sl_string_size_t remaining_length = sl_string__get_capacity(string) - current_length;
      strncat(string, append, remaining_length);
      result = true;
    }
  }

  return result;
}

bool sl_string__append_char(sl_string_t string, char append) {
  const char string_to_append[] = {append, '\0'};
  return sl_string__append(string, string_to_append);
}

bool sl_string__equals_to(const sl_string_t string, const char *compare_with) {
  bool equal = false;

  if (NULL != compare_with) {
    equal = (0 == strcmp(string, compare_with));
  }

  return equal;
}

bool sl_string__equals_to_ignore_case(const sl_string_t string, const char *compare_with_case_ignored) {
  bool equal = false;

  if (NULL != compare_with_case_ignored) {
    equal = (0 == strcasecmp(string, compare_with_case_ignored));
  }

  return equal;
}

int sl_string__last_index_of(const sl_string_t string, const char *index_of) {
  const char *pointer_to_last = NULL;

  if (NULL != index_of) {
    const char *pointer_to_first_in_substring = strstr(string, index_of);
    const size_t substring_length = strlen(index_of);

    while (NULL != pointer_to_first_in_substring) {
      pointer_to_last = pointer_to_first_in_substring;
      pointer_to_first_in_substring = strstr(pointer_to_first_in_substring + substring_length, index_of);
    }
  }

  return ((NULL != pointer_to_last) ? (int)(pointer_to_last - string) : sl_string_error);
}

int sl_string__last_index_of_ignore_case(const sl_string_t string, const char *index_of_case_ignored) {
  int index_of_string = sl_string_error;

  if (NULL != index_of_case_ignored) {
    const char *pointer_to_first_char_in_substring = strchr(string, tolower((int)(*index_of_case_ignored)));
    if (NULL == pointer_to_first_char_in_substring) {
      pointer_to_first_char_in_substring = strchr(string, toupper((int)(*index_of_case_ignored)));
    }

    const size_t length_of_string_to_find = strlen(index_of_case_ignored);
    while (NULL != pointer_to_first_char_in_substring) {
      size_t num_of_chars_to_move_substring_start_location = 1;

      if (0 == strncasecmp(pointer_to_first_char_in_substring, index_of_case_ignored, length_of_string_to_find)) {
        index_of_string = (int)(pointer_to_first_char_in_substring - string);
        num_of_chars_to_move_substring_start_location = length_of_string_to_find;
      }

      const char *pointer_to_last_char = pointer_to_first_char_in_substring;
      pointer_to_first_char_in_substring = strchr(pointer_to_last_char + num_of_chars_to_move_substring_start_location,
                                                  tolower((int)(*index_of_case_ignored)));

      if (NULL == pointer_to_first_char_in_substring) {
        pointer_to_first_char_in_substring =
            strchr(pointer_to_last_char + num_of_chars_to_move_substring_start_location,
                   toupper((int)(*index_of_case_ignored)));
      }
    }
  }

