CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_standalone/string/sl_string.c
  return index_of_string;
}

int sl_string__first_index_of(const sl_string_t string, const char *index_of) {
  const char *pointer_to_first = NULL;

  if (NULL != index_of) {
    pointer_to_first = strstr(string, index_of);
  }

  return ((NULL != pointer_to_first) ? (int)(pointer_to_first - string) : sl_string_error);
}

int sl_string__first_index_of_ignore_case(const sl_string_t string, const char *index_of_case_ignored) {
  int index_of_string = sl_string_error;

  if (NULL != index_of_case_ignored) {
    const char *pointer_to_first_char_in_substring = strchr(string, tolower((int)(*index_of_case_ignored)));
    if (NULL == pointer_to_first_char_in_substring) {
      pointer_to_first_char_in_substring = strchr(string, toupper((int)(*index_of_case_ignored)));
    }

    const size_t length_of_index_of_case_ignored = strlen(index_of_case_ignored);
    while (NULL != pointer_to_first_char_in_substring) {
      size_t num_of_chars_to_move_substring_start_location = 1;

      if (0 ==
          strncasecmp(pointer_to_first_char_in_substring, index_of_case_ignored, length_of_index_of_case_ignored)) {
        index_of_string = (int)(pointer_to_first_char_in_substring - string);
        break;
      }

      const char *first_char_in_substring_storage_ptr = pointer_to_first_char_in_substring;
      pointer_to_first_char_in_substring =
          strchr(first_char_in_substring_storage_ptr + num_of_chars_to_move_substring_start_location,
                 tolower((int)(*index_of_case_ignored)));

      if (NULL == pointer_to_first_char_in_substring) {
        pointer_to_first_char_in_substring =
            strchr(first_char_in_substring_storage_ptr + num_of_chars_to_move_substring_start_location,
                   toupper((int)(*index_of_case_ignored)));
      }
    }
  }

  return index_of_string;
}

bool sl_string__contains(const sl_string_t string, const char *substring) {
  return (sl_string_error != sl_string__first_index_of(string, substring));
}

bool sl_string__contains_ignore_case(const sl_string_t string, const char *substring_case_ignored) {
  return (sl_string_error != sl_string__first_index_of_ignore_case(string, substring_case_ignored));
}

int sl_string__count_of(const sl_string_t string, const char *count_of) {
  int count = sl_string_error;

  if (NULL != count_of) {
    count = 0;
    const char *pointer_to_first_in_substring = strstr(string, count_of);
    const size_t length_of_count_of_string = strlen(count_of);
    while (NULL != pointer_to_first_in_substring) {
      count++;
      pointer_to_first_in_substring = strstr(pointer_to_first_in_substring + length_of_count_of_string, count_of);
    }
  }

  return count;
}

bool sl_string__begins_with(const sl_string_t string, const char *begin_with) {
  const size_t substring_length = (NULL == begin_with) ? 0U : strlen(begin_with);
  return sl_string__begins_with_limited_chars(string, begin_with, substring_length);
}

bool sl_string__begins_with_limited_chars(const sl_string_t string, const char *begin_with,
                                          size_t max_chars_of_begin_with_to_compare) {
  bool result = false;

  if (NULL != begin_with) {
    const sl_string_size_t string_length = sl_string__get_length(string);

    // strncmp/strncasecmp are used here instead of strstr as it
    // allows to check only the beginning of the string
    if (string_length >= max_chars_of_begin_with_to_compare) {
      if (0 == strncmp(string, begin_with, max_chars_of_begin_with_to_compare)) {
        result = true;
      }
    }
  }

  return result;
}

bool sl_string__begins_with_ignore_case(const sl_string_t string, const char *begin_with_case_ignored) {
  bool result = false;

  if (NULL != begin_with_case_ignored) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t substring_length = strlen(begin_with_case_ignored);

    // strncmp/strncasecmp are used here instead of strstr as it
    // allows to check only the beginning of the string
    if (string_length >= substring_length) {
      if (0 == strncasecmp(string, begin_with_case_ignored, substring_length)) {
        result = true;
      }
    }
  }

  return result;
}

bool sl_string__begins_with_whole_word(const sl_string_t string, const char *begin_with, const char *delimiter_string) {
  bool result = false;

  if ((NULL != begin_with) && (NULL != delimiter_string)) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t substring_length = strlen(begin_with);

    // strncmp/strncasecmp are used here instead of strstr as it
    // allows to check only the beginning of the string
    if (string_length >= substring_length) {
      if (0 == strncmp(string, begin_with, substring_length)) {
        result = ((*delimiter_string == string[substring_length]) || ('\0' == string[substring_length]));
      }
    }
  }

  return result;
}

bool sl_string__begins_with_whole_word_ignore_case(const sl_string_t string, const char *begin_with_case_ignored,
                                                   const char *delimiter_string) {
  bool result = false;

  if ((NULL != begin_with_case_ignored) && (NULL != delimiter_string)) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t substring_length = strlen(begin_with_case_ignored);

    if (string_length >= substring_length) {
      if (0 == strncasecmp(string, begin_with_case_ignored, substring_length)) {
        result = ((*delimiter_string == string[substring_length]) || ('\0' == *delimiter_string));
      }
    }
  }

  return result;
}

bool sl_string__ends_with(const sl_string_t string, const char *ends_with) {
  bool result = false;

  if (NULL != ends_with) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t substring_length = strlen(ends_with);

    if (string_length >= substring_length) {
      if (0 == strncmp(string + string_length - substring_length, ends_with, substring_length)) {
        result = true;
      }
    }
  }

  return result;
}

bool sl_string__ends_with_ignore_case(const sl_string_t string, const char *ends_with_case_ignored) {
  bool result = false;

  if (NULL != ends_with_case_ignored) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t substring_length = strlen(ends_with_case_ignored);

    if (string_length >= substring_length) {
      if (0 == strncasecmp(string + string_length - substring_length, ends_with_case_ignored, substring_length)) {
        result = true;
      }
    }
  }

  return result;
}

bool sl_string__ends_with_newline(const sl_string_t string) {
  bool status = false;
  const sl_string_size_t length = sl_string__get_length(string);

  if (length > 0) {
    const sl_string_size_t last_index = length - 1;
    const char last_char = string[last_index];
    status = ('\r' == last_char) || ('\n' == last_char);
  }

