CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/lpc40xx_freertos/l2_standalone/string/sl_string.c
  return status;
}

bool sl_string__erase(sl_string_t string, const char *erase) {
  bool result = false;

  if (NULL != erase) {
    const int index_to_erase = sl_string__first_index_of(string, erase);
    if (sl_string_error != index_to_erase) {
      result = sl_string__erase_after(string, (sl_string_size_t)index_to_erase, (sl_string_size_t)strlen(erase));
    }
  }

  return result;
}

bool sl_string__erase_first(sl_string_t string, sl_string_size_t n_chars) {
  return sl_string__erase_after(string, 0, n_chars);
}

bool sl_string__erase_last(sl_string_t string, sl_string_size_t n_chars) {
  const sl_string_size_t string_length = sl_string__get_length(string);
  const sl_string_size_t start_of_erase_index =
      (n_chars > string_length) ? 0U : (sl_string_size_t)(string_length - n_chars);

  return sl_string__erase_after(string, start_of_erase_index, n_chars);
}

bool sl_string__erase_at(sl_string_t string, sl_string_size_t index_position) {
  return sl_string__erase_after(string, index_position, 1);
}

bool sl_string__erase_after(sl_string_t string, sl_string_size_t erase_index_position, sl_string_size_t n_chars) {
  const sl_string_size_t string_length = sl_string__get_length(string);
  bool result = false;

  if (erase_index_position < string_length) {
    n_chars = (n_chars > (string_length - erase_index_position)) ? (string_length - erase_index_position) : n_chars;
    const sl_string_size_t num_chars_to_move = string_length - erase_index_position - n_chars + 1U;

    memmove(string + erase_index_position, string + erase_index_position + n_chars, num_chars_to_move);
    result = true;
  }

  return result;
}

bool sl_string__erase_first_word(sl_string_t string, char word_separater) {
  bool result = false;
  const char *word_ptr = strchr(string, (int)word_separater);

  if (NULL != word_ptr) {
    int n_chars = (int)(word_ptr - string) + 1;
    result = sl_string__erase_first(string, (uint16_t)n_chars); // Plus 1 to also erase the word_seperator
  }

  return result;
}

sl_string_size_t sl_string__erase_special_chars(sl_string_t string) {
  sl_string_size_t chars_removed = 0;
  const sl_string_size_t string_length = sl_string__get_length(string);

  for (sl_string_size_t character = 0; character < string_length; character++) {
    if (0U == isalnum((uint8_t)string[character])) {
      if (!sl_string__erase_at(string, (sl_string_size_t)character)) {
        break;
      }
      character--;
      chars_removed++;
    }
  }

  return chars_removed;
}

bool sl_string__trim_end(sl_string_t string, const char *chars_to_trim) {
  bool result = false;

  if (NULL != chars_to_trim) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t trim_char_length = strlen(chars_to_trim);

    for (int character = ((int)string_length - 1); character >= 0; character--) {
      bool trim_done = false;

      for (size_t trim_char = 0; trim_char < trim_char_length; trim_char++) {
        if (chars_to_trim[trim_char] == string[character]) {
          string[character] = '\0';
          trim_done = true;
          break;
        }
      }

      if (!trim_done) {
        break;
      }
    }
    result = true;
  }

  return result;
}

bool sl_string__trim_start(sl_string_t string, const char *chars_to_trim) {
  bool result = false;
  sl_string_size_t n_chars = 0;

  if (NULL != chars_to_trim) {
    const sl_string_size_t string_length = sl_string__get_length(string);
    const size_t trim_char_length = strlen(chars_to_trim);

    for (; n_chars < string_length; n_chars++) {
      bool trim_done = false;

      for (size_t trim_char = 0; trim_char < trim_char_length; trim_char++) {
        if (chars_to_trim[trim_char] == string[n_chars]) {
          trim_done = true;
          break;
        }
      }

      if (!trim_done) {
        result = sl_string__erase_first(string, n_chars);
        break;
      }
    }
  }

  return result;
}

bool sl_string__replace_first(sl_string_t string, const char *replace, const char *replace_with) {
  bool result = false;

  if ((NULL != replace) && (NULL != replace_with)) {
    const int start_of_replace_index = sl_string__first_index_of(string, replace);
    result = true;

    if (sl_string_error != start_of_replace_index) {
      result =
          sl_string__erase_after(string, (sl_string_size_t)start_of_replace_index, (sl_string_size_t)strlen(replace));

      if (result) {
        result = sl_string__insert_at(string, (uint16_t)start_of_replace_index, replace_with);
      }
    }
  }

  return result;
}

bool sl_string__replace_last(sl_string_t string, const char *replace, const char *replace_with) {
  bool result = false;

  if ((NULL != replace) && (NULL != replace_with)) {
    const int start_of_replace_index = sl_string__last_index_of(string, replace);
    result = true;

    if (sl_string_error != start_of_replace_index) {
      result =
          sl_string__erase_after(string, (sl_string_size_t)start_of_replace_index, (sl_string_size_t)strlen(replace));

      if (result) {
        result = sl_string__insert_at(string, (sl_string_size_t)start_of_replace_index, replace_with);
      }
    }
  }

  return result;
}

int sl_string__replace_all(sl_string_t string, const char *replace, const char *replace_with) {
  int num_replaced = sl_string_error;

  if ((NULL != replace) && (NULL != replace_with)) {
    int start_of_replace_index = sl_string__first_index_of(string, replace);
    num_replaced = 0;

    const sl_string_size_t length_of_replace = (sl_string_size_t)strlen(replace);
    while (sl_string_error != start_of_replace_index) {
      bool result = sl_string__erase_after(string, (sl_string_size_t)start_of_replace_index, length_of_replace);
      if (result) {
        (void)sl_string__insert_at(string, (sl_string_size_t)start_of_replace_index, replace_with);
      }

      start_of_replace_index = sl_string__first_index_of(string, replace);
      num_replaced++;
    }
  }

  return num_replaced;
}
